<?php

namespace app\common\model;

/**
 * @package app\common\model
 */
class Projects extends BaseModel
{
    protected $name = 'projects';


    protected $server_cate = [
        '1' => '投资咨询',
        '2' => '招标代理',
        '3' => '勘察',
        '4' => '规划计划',
        '5' => '监理',
        '6' => '造价',
        '7' => '项目管理',
        '8' => '其他服务'
    ];

    protected $eng_cate = [
        '1'=> '农业林业',
        '2'=> '水利水电',
        '3'=> '电力',
        '4'=> '煤炭',
        '5'=> '石油天然气',
        '6'=> '公路',
        '7'=> '轨道交通',
        '8'=> '民航',        
        // 工程类别包括：农业林业；水利水电；电力；煤炭；石油天然气；公路；轨道交通；民航；水运；电子信息；冶金；石化化工医药；核工业；机械；轻工纺织；建材；建筑；市政公用；生态环境；水文地质岩土；其他工程。
    ];
}
